; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v10 ?v5)
             (pred_6 ?v6 ?v9)
             (pred_3 ?v10 ?v9)
             (pred_10 ?v13 ?v10 )
	     (pred_11 ?v10)
             (pred_9 ?v2)
             (pred_12 ?v6)
             (pred_4 ?v9)
             (pred_5 ?v10)
             (pred_8 ?v6)
             (pred_2 ?v10)
             (pred_7 ))



(:action op_2
:parameters (?v4 ?v12 ?v11 ?v7)
:precondition (and (pred_9 ?v4) (pred_9 ?v12) (pred_12 ?v11) (pred_4 ?v7)
          (pred_1 ?v4 ?v12) (pred_6 ?v11 ?v7)
                   (pred_3 ?v12 ?v7) (pred_11 ?v4) 
                   (pred_5 ?v12) (pred_8 ?v11))
:effect (and  (pred_2 ?v12) (not (pred_5 ?v12))))


(:action op_1
:parameters (?v4 ?v1)
:precondition (and (pred_9 ?v4) (pred_9 ?v1)
               (pred_11 ?v4) (pred_1 ?v4 ?v1) (pred_2 ?v1))
:effect (and (pred_11 ?v1) (not (pred_11 ?v4))))

(:action op_4
:parameters (?v4 ?v11)
:precondition (and (pred_9 ?v4) (pred_12 ?v11) 
                  (pred_11 ?v4) (pred_10 ?v11 ?v4) (pred_7 ))
:effect (and (pred_8 ?v11)
   (not (pred_10 ?v11 ?v4)) (not (pred_7 ))))


(:action op_3
:parameters (?v4 ?v8 ?v3)
:precondition (and (pred_9 ?v4) (pred_12 ?v8) (pred_12 ?v3)
                  (pred_11 ?v4) (pred_8 ?v3) (pred_10 ?v8 ?v4))
:effect (and (pred_8 ?v8) (pred_10 ?v3 ?v4)
        (not (pred_8 ?v3)) (not (pred_10 ?v8 ?v4))))

(:action op_5
:parameters (?v4 ?v11)
:precondition (and (pred_9 ?v4) (pred_12 ?v11) 
                  (pred_11 ?v4) (pred_8 ?v11))
:effect (and (pred_7 ) (pred_10 ?v11 ?v4) (not (pred_8 ?v11)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_01 obj_07 obj_03 obj_08 obj_14 obj_17 obj_06 obj_05 obj_19 obj_20 obj_13 obj_16 obj_11 obj_15 obj_02 obj_04
    obj_18 obj_09
    obj_12 obj_10
    )

    (:init
       (pred_7)

       (pred_9 obj_01)
       (pred_9 obj_07)
       (pred_9 obj_03)
       (pred_9 obj_08)
       (pred_9 obj_14)
       (pred_9 obj_17)
       (pred_9 obj_06)
       (pred_9 obj_05)
       (pred_9 obj_19)
       (pred_9 obj_20)
       (pred_9 obj_13)
       (pred_9 obj_16)
       (pred_9 obj_11)
       (pred_9 obj_15)
       (pred_9 obj_02)
       (pred_9 obj_04)
       (pred_4 obj_18)
       (pred_4 obj_09)
       (pred_12 obj_12)
       (pred_12 obj_10)

       (pred_1 obj_01 obj_14)
       (pred_1 obj_01 obj_07)
       (pred_1 obj_07 obj_17)
       (pred_1 obj_07 obj_03)
       (pred_1 obj_07 obj_01)
       (pred_1 obj_03 obj_06)
       (pred_1 obj_03 obj_08)
       (pred_1 obj_03 obj_07)
       (pred_1 obj_08 obj_05)
       (pred_1 obj_08 obj_03)
       (pred_1 obj_14 obj_19)
       (pred_1 obj_14 obj_17)
       (pred_1 obj_14 obj_01)
       (pred_1 obj_17 obj_20)
       (pred_1 obj_17 obj_06)
       (pred_1 obj_17 obj_07)
       (pred_1 obj_17 obj_14)
       (pred_1 obj_06 obj_13)
       (pred_1 obj_06 obj_05)
       (pred_1 obj_06 obj_03)
       (pred_1 obj_06 obj_17)
       (pred_1 obj_05 obj_16)
       (pred_1 obj_05 obj_08)
       (pred_1 obj_05 obj_06)
       (pred_1 obj_19 obj_11)
       (pred_1 obj_19 obj_20)
       (pred_1 obj_19 obj_14)
       (pred_1 obj_20 obj_15)
       (pred_1 obj_20 obj_13)
       (pred_1 obj_20 obj_17)
       (pred_1 obj_20 obj_19)
       (pred_1 obj_13 obj_02)
       (pred_1 obj_13 obj_16)
       (pred_1 obj_13 obj_06)
       (pred_1 obj_13 obj_20)
       (pred_1 obj_16 obj_04)
       (pred_1 obj_16 obj_05)
       (pred_1 obj_16 obj_13)
       (pred_1 obj_11 obj_15)
       (pred_1 obj_11 obj_19)
       (pred_1 obj_15 obj_02)
       (pred_1 obj_15 obj_20)
       (pred_1 obj_15 obj_11)
       (pred_1 obj_02 obj_04)
       (pred_1 obj_02 obj_13)
       (pred_1 obj_02 obj_15)
       (pred_1 obj_04 obj_16)
       (pred_1 obj_04 obj_02)
       (pred_5 obj_07)
       (pred_5 obj_08)
       (pred_3  obj_07 obj_18)
       (pred_3  obj_08 obj_09)
       (pred_2 obj_01)
       (pred_2 obj_03)
       (pred_2 obj_14)
       (pred_2 obj_17)
       (pred_2 obj_06)
       (pred_2 obj_05)
       (pred_2 obj_19)
       (pred_2 obj_20)
       (pred_2 obj_13)
       (pred_2 obj_16)
       (pred_2 obj_11)
       (pred_2 obj_15)
       (pred_2 obj_02)
       (pred_2 obj_04)

       (pred_6  obj_12 obj_18)
       (pred_6  obj_10 obj_09)
       (pred_10 obj_12 obj_16)
       (pred_10 obj_10 obj_02)
       (pred_11 obj_04)
    )

    (:goal (and
       (pred_10 obj_10 obj_08)
    ))
(:constraints
  (always (not (pred_11 obj_03)))
)
)

; plan
1. (op_1 obj_04 obj_02)
   deleted: (pred_11 obj_04)
   added: (pred_11 obj_02)
   goals met: 0 of 1
2. (op_4 obj_02 obj_10)
   deleted: (pred_10 obj_10 obj_02) (pred_7)
   added: (pred_8 obj_10)
   goals met: 0 of 1
3. (op_1 obj_02 obj_13)
   deleted: (pred_11 obj_02)
   added: (pred_11 obj_13)
   goals met: 0 of 1
4. (op_1 obj_13 obj_06)
   deleted: (pred_11 obj_13)
   added: (pred_11 obj_06)
   goals met: 0 of 1
5. (op_1 obj_06 obj_05)
   deleted: (pred_11 obj_06)
   added: (pred_11 obj_05)
   goals met: 0 of 1
6. (op_2 obj_05 obj_08 obj_10 obj_09)
   deleted: (pred_5 obj_08)
   added: (pred_2 obj_08)
   goals met: 0 of 1
7. (op_1 obj_05 obj_08)
   deleted: (pred_11 obj_05)
   added: (pred_11 obj_08)
   goals met: 0 of 1
8. (op_5 obj_08 obj_10)
   deleted: (pred_8 obj_10)
   added: (pred_7) (pred_10 obj_10 obj_08)
   goals met: 1 of 1
